###############################################################################
# Created by write_sdc
# Tue Sep  5 17:54:39 2023
###############################################################################
current_design Eighty_Twos
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cs}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[32]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[33]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpi[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nrst}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[32]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[33]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpo[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_en}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {store_en}]
set_load -pin_load 0.0334 [get_ports {gpo[33]}]
set_load -pin_load 0.0334 [get_ports {gpo[32]}]
set_load -pin_load 0.0334 [get_ports {gpo[31]}]
set_load -pin_load 0.0334 [get_ports {gpo[30]}]
set_load -pin_load 0.0334 [get_ports {gpo[29]}]
set_load -pin_load 0.0334 [get_ports {gpo[28]}]
set_load -pin_load 0.0334 [get_ports {gpo[27]}]
set_load -pin_load 0.0334 [get_ports {gpo[26]}]
set_load -pin_load 0.0334 [get_ports {gpo[25]}]
set_load -pin_load 0.0334 [get_ports {gpo[24]}]
set_load -pin_load 0.0334 [get_ports {gpo[23]}]
set_load -pin_load 0.0334 [get_ports {gpo[22]}]
set_load -pin_load 0.0334 [get_ports {gpo[21]}]
set_load -pin_load 0.0334 [get_ports {gpo[20]}]
set_load -pin_load 0.0334 [get_ports {gpo[19]}]
set_load -pin_load 0.0334 [get_ports {gpo[18]}]
set_load -pin_load 0.0334 [get_ports {gpo[17]}]
set_load -pin_load 0.0334 [get_ports {gpo[16]}]
set_load -pin_load 0.0334 [get_ports {gpo[15]}]
set_load -pin_load 0.0334 [get_ports {gpo[14]}]
set_load -pin_load 0.0334 [get_ports {gpo[13]}]
set_load -pin_load 0.0334 [get_ports {gpo[12]}]
set_load -pin_load 0.0334 [get_ports {gpo[11]}]
set_load -pin_load 0.0334 [get_ports {gpo[10]}]
set_load -pin_load 0.0334 [get_ports {gpo[9]}]
set_load -pin_load 0.0334 [get_ports {gpo[8]}]
set_load -pin_load 0.0334 [get_ports {gpo[7]}]
set_load -pin_load 0.0334 [get_ports {gpo[6]}]
set_load -pin_load 0.0334 [get_ports {gpo[5]}]
set_load -pin_load 0.0334 [get_ports {gpo[4]}]
set_load -pin_load 0.0334 [get_ports {gpo[3]}]
set_load -pin_load 0.0334 [get_ports {gpo[2]}]
set_load -pin_load 0.0334 [get_ports {gpo[1]}]
set_load -pin_load 0.0334 [get_ports {gpo[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cs}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nrst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpi[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 20.0000 [current_design]
