###############################################################################
# Created by write_sdc
# Mon Aug 28 02:01:28 2023
###############################################################################
current_design Guitar_Villains
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {button[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {button[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {button[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {button[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chip_select}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {n_rst}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bottom_row[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {green_disp}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {red_disp}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss0[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ss1[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {top_row[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {green_disp}]
set_load -pin_load 0.0334 [get_ports {red_disp}]
set_load -pin_load 0.0334 [get_ports {bottom_row[6]}]
set_load -pin_load 0.0334 [get_ports {bottom_row[5]}]
set_load -pin_load 0.0334 [get_ports {bottom_row[4]}]
set_load -pin_load 0.0334 [get_ports {bottom_row[3]}]
set_load -pin_load 0.0334 [get_ports {bottom_row[2]}]
set_load -pin_load 0.0334 [get_ports {bottom_row[1]}]
set_load -pin_load 0.0334 [get_ports {bottom_row[0]}]
set_load -pin_load 0.0334 [get_ports {ss0[6]}]
set_load -pin_load 0.0334 [get_ports {ss0[5]}]
set_load -pin_load 0.0334 [get_ports {ss0[4]}]
set_load -pin_load 0.0334 [get_ports {ss0[3]}]
set_load -pin_load 0.0334 [get_ports {ss0[2]}]
set_load -pin_load 0.0334 [get_ports {ss0[1]}]
set_load -pin_load 0.0334 [get_ports {ss0[0]}]
set_load -pin_load 0.0334 [get_ports {ss1[6]}]
set_load -pin_load 0.0334 [get_ports {ss1[5]}]
set_load -pin_load 0.0334 [get_ports {ss1[4]}]
set_load -pin_load 0.0334 [get_ports {ss1[3]}]
set_load -pin_load 0.0334 [get_ports {ss1[2]}]
set_load -pin_load 0.0334 [get_ports {ss1[1]}]
set_load -pin_load 0.0334 [get_ports {ss1[0]}]
set_load -pin_load 0.0334 [get_ports {top_row[6]}]
set_load -pin_load 0.0334 [get_ports {top_row[5]}]
set_load -pin_load 0.0334 [get_ports {top_row[4]}]
set_load -pin_load 0.0334 [get_ports {top_row[3]}]
set_load -pin_load 0.0334 [get_ports {top_row[2]}]
set_load -pin_load 0.0334 [get_ports {top_row[1]}]
set_load -pin_load 0.0334 [get_ports {top_row[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chip_select}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {n_rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {button[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {button[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {button[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {button[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 20.0000 [current_design]
