###############################################################################
# Created by write_sdc
# Sat Sep  9 21:53:15 2023
###############################################################################
current_design sass_synth
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name hwclk -period 100.0000 [get_ports {hwclk}]
set_clock_transition 0.1500 [get_clocks {hwclk}]
set_clock_uncertainty 0.2500 hwclk
set_propagated_clock [get_clocks {hwclk}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {cs}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {n_rst}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[0]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[10]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[11]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[12]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[13]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[14]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[1]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[2]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[3]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[4]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[5]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[6]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[7]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[8]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {piano_keys[9]}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {seq_play}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {seq_power}]
set_input_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {tempo_select}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[2]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[3]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[4]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[5]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[6]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {beat_led[7]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {mode_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {mode_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {multi[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {multi[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {multi[2]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {multi[3]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note1[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note1[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note1[2]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note1[3]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note2[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note2[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note2[2]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note2[3]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note3[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note3[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note3[2]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note3[3]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note4[0]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note4[1]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note4[2]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {note4[3]}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {pwm_o}]
set_output_delay 20.0000 -clock [get_clocks {hwclk}] -add_delay [get_ports {seq_led_on}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {pwm_o}]
set_load -pin_load 0.0334 [get_ports {seq_led_on}]
set_load -pin_load 0.0334 [get_ports {beat_led[7]}]
set_load -pin_load 0.0334 [get_ports {beat_led[6]}]
set_load -pin_load 0.0334 [get_ports {beat_led[5]}]
set_load -pin_load 0.0334 [get_ports {beat_led[4]}]
set_load -pin_load 0.0334 [get_ports {beat_led[3]}]
set_load -pin_load 0.0334 [get_ports {beat_led[2]}]
set_load -pin_load 0.0334 [get_ports {beat_led[1]}]
set_load -pin_load 0.0334 [get_ports {beat_led[0]}]
set_load -pin_load 0.0334 [get_ports {mode_out[1]}]
set_load -pin_load 0.0334 [get_ports {mode_out[0]}]
set_load -pin_load 0.0334 [get_ports {multi[3]}]
set_load -pin_load 0.0334 [get_ports {multi[2]}]
set_load -pin_load 0.0334 [get_ports {multi[1]}]
set_load -pin_load 0.0334 [get_ports {multi[0]}]
set_load -pin_load 0.0334 [get_ports {note1[3]}]
set_load -pin_load 0.0334 [get_ports {note1[2]}]
set_load -pin_load 0.0334 [get_ports {note1[1]}]
set_load -pin_load 0.0334 [get_ports {note1[0]}]
set_load -pin_load 0.0334 [get_ports {note2[3]}]
set_load -pin_load 0.0334 [get_ports {note2[2]}]
set_load -pin_load 0.0334 [get_ports {note2[1]}]
set_load -pin_load 0.0334 [get_ports {note2[0]}]
set_load -pin_load 0.0334 [get_ports {note3[3]}]
set_load -pin_load 0.0334 [get_ports {note3[2]}]
set_load -pin_load 0.0334 [get_ports {note3[1]}]
set_load -pin_load 0.0334 [get_ports {note3[0]}]
set_load -pin_load 0.0334 [get_ports {note4[3]}]
set_load -pin_load 0.0334 [get_ports {note4[2]}]
set_load -pin_load 0.0334 [get_ports {note4[1]}]
set_load -pin_load 0.0334 [get_ports {note4[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cs}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hwclk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {n_rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {seq_play}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {seq_power}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tempo_select}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {piano_keys[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 20.0000 [current_design]
