###############################################################################
# Created by write_sdc
# Tue Aug  8 21:17:11 2023
###############################################################################
current_design top8227
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusEnable}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInput[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {interruptRequest}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nonMaskableInterrupt}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nrst}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ready}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {setOverflow}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M10ClkOut}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusHigh[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addressBusLow[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOutput[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusSelect}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {functionalClockOut}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readNotWrite}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sync}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {M10ClkOut}]
set_load -pin_load 0.0334 [get_ports {dataBusSelect}]
set_load -pin_load 0.0334 [get_ports {functionalClockOut}]
set_load -pin_load 0.0334 [get_ports {readNotWrite}]
set_load -pin_load 0.0334 [get_ports {sync}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[7]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[6]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[5]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[4]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[3]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[2]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[1]}]
set_load -pin_load 0.0334 [get_ports {addressBusHigh[0]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[7]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[6]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[5]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[4]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[3]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[2]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[1]}]
set_load -pin_load 0.0334 [get_ports {addressBusLow[0]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[7]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[6]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[5]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[4]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[3]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[2]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[1]}]
set_load -pin_load 0.0334 [get_ports {dataBusOutput[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {interruptRequest}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nonMaskableInterrupt}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nrst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {setOverflow}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInput[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
